{
  "categories": [
    {
      "id": 1,
      "category": "Вогнепальна зброя",
      "link": "firearm",
      "subcategories": [
        {
          "subcategory": "Рушниці",
          "link": "rushnytsi"
        },
        {
          "subcategory": "Гвинтівки та карабіни",
          "link": "hvyntivky-karabiny"
        },
        {
          "subcategory": "Комбінована зброя",
          "link": "kombinovana-zbroia"
        }
      ]
    },
    {
      "id": 2,
      "category": "Пістолети та револьвери",
      "link": "handguns",
      "subcategories": [
        {
          "subcategory": "Спортивна зброя",
          "link": "korotkostvolna-zbroya"
        },
        {
          "subcategory": "Сигнально-шумова зброя",
          "link": "shumova-zbroia"
        },
        {
          "subcategory": "Травматичні пістолети",
          "link": "pistoleti"
        },
        {
          "subcategory": "Травматичні револьвери",
          "link": "revolveri"
        },
        {
          "subcategory": "Комісійна травматична зброя",
          "link": "travmatychna"
        }
      ]
    },
    {
      "id": 3,
      "category": "Пневматична зброя",
      "link": "pneumatic",
      "subcategories": [
        {
          "subcategory": "Пневматичні гвинтівки",
          "link": "pnevmatychni-hvyntivky"
        },
        {
          "subcategory": "Пневматичні пістолети",
          "link": "pnevmatychni-pistolety"
        },
        {
          "subcategory": "Страйкбольна зброя",
          "link": "straykbolna-zbroya"
        },
        {
          "subcategory": "Пневматичні набої та балони",
          "link": "boepripasy"
        },
        {
          "subcategory": "Комплектуючі до пневматичної зброї",
          "link": "komplektuiuchi-pnevmatyka"
        }
      ]
    },
    {
      "id": 4,
      "category": "Ножі",
      "link": "knives",
      "subcategories": [
        {
          "subcategory": "Міські ножі",
          "link": "edc-knives"
        },
        {
          "subcategory": "Тактичні ножі",
          "link": "tactical-knives"
        },
        {
          "subcategory": "Армійські ножі",
          "link": "army-knives"
        },
        {
          "subcategory": "Сокири",
          "link": "axe"
        }
      ]
    },
    {
      "id": 5,
      "category": "Екіпірування",
      "link": "ammunition",
      "subcategories": [
        {
          "subcategory": "Тюнінг",
          "link": "boepripasy"
        },
        {
          "subcategory": "Аксесуари",
          "link": "boepripasy"
        },
        {
          "subcategory": "Інструменти",
          "link": "boepripasy"
        },
        {
          "subcategory": "Приціли",
          "link": "boepripasy"
        }
      ]
    }
  ],
  "products": [
    {
      "id": "1",
      "name": "Boker Magnum Oblong Hole",
      "manufacturer": "Boker",
      "category": "firearm",
      "subcategory": "army-knives",
      "description": "Ніж з фіксованим клинком Boker Magnum Oblong Hole призначений для повсякденного носіння і використання під час відпочинку на природі. Клинок виготовлений зі сталі 440А, на обуху є упор для великого пальця з великими насічками. Накладки рукояті виконані з полімерного матеріалу з приємним на дотик прогумованим покриттям (типу Softouch). Відчини в рукояті покликані полегшити вагу ножа. У комплект входять піхви з кордури.Упакований у фірмову коробку з логотипом компанії.",
      "weight": "96 g",
      "steel grade": "440A",
      "knife type": "non-folding",
      "blade length": "121 mm",
      "country_of_manufacture": "USA",
      "price": "1 060",
      "rating": 8,
      "stock_status": true
    },
    {
      "id": "2",
      "name": "Ніж із фіксованим клинком Buck Kalinga 2021 Legacy Collection",
      "manufacturer": "Buck Kalinga",
      "category": "knives",
      "subcategory": "tactical-knives",
      "description": " Перед нами класичний мисливський ніж із яскраво вираженим черевцем ріжучої кромки та \"задертим\" вгору вістрям. Така конфігурація дозволяє знімати шкуру зі здобутого трофею без остраху пошкодити її. Клинок лімітованої серії виконаний із порошкової нержавіючої сталі марки CPM S35VN. Сталь відмінно тримає робочу гостроту, не схильна до появи іржі і навіть пітингу, легко точиться і правиться в польових умовах, що дуже важливо для мисливського ножа. Руків'я моделі має ергономічну форму і виконане з мікарти. Доповнює картину масивний обмежувач, що захищає вашу руку від зісковзування на ріжучу кромку. Модель комплектується піхвами з натуральної шкіри.",
      "weight": "330 g",
      "steel grade": "S35VN",
      "knife type": "non-folding",
      "blade length": "254 mm",
      "country_of_manufacture": "USA",
      "price": "18 480",
      "rating": 5,
      "stock_status": true
    },
    {
      "id": "3",
      "name": "Карабін FLARM F4 223Rem",
      "category": "firearm",
      "subcategory": "hvyntivky-karabiny",
      "manufacturer": "Flarm",
      "description": "Карабін FLARM F4 калібру 223Rem з 11.5-дюймовим стволом являє собою комбінацію легкості, широких можливостей індивідуальної настройки, універсальності і сучасного дизайну, що робить його оптимальним вибором для широкого спектру завдань. Його легка вага (менше 3 кг) не тільки забезпечує комфорт при носінні, але і дозволяє стрілку залишатися маневреним в різних ситуаціях. А завдяки 1-ступінчастому спортивному ударно-спусковому механізму Timney Triggers, який характеризується коротким і м'яким ходом, стрілок отримує максимальну керованість. Інноваційна система з коротким ходом газового поршня забезпечує більш ефективне в порівнянні зі стандартним компонуванням AR-15 запобігання попадання продуктів згоряння пороху всередину зброї. Це не тільки підвищує безпеку, але й покращує довговічність. Плюс така система сприяє мінімізації нагріву і засміченню затворної групи. Це важлива перевага, яка призводить до підвищеної надійності роботи.",
      "weight": "2,89 кг",
      "caliber": ".223 Rem",
      "barrel twist": "1:8\"",
      "weapon platform": "AR-15",
      "color": "black",
      "country_of_manufacture": "Ukraine",
      "price": "116 932.0",
      "rating": 9,
      "stock_status": true
    },
    {
      "id": "4",
      "name": "Карабін DPMS DR-15 16” кал .223 Rem",
      "category": "firearm",
      "subcategory": "hvyntivky-karabiny",
      "manufacturer": "DPMS",
      "description": "DR-15 - це сучасний напівавтоматичний карабін на платформі AR-15 від американського виробника DPMS. Наразі це одна з найбюджетніших пропозицій карабіну AR-15 на ринку України. Характерною особливістю моделі є незначна маса (до 3 кг) та гарна збалансованість. Карабін оснащений стволом, виготовленим із хром-молібден-ванадієвої сталі марки 4150V з фосфатованим покриттям, яке забезпечує додатковий захист від корозії. Довжина ствола 16” а крок нарізів (твіст) 1:7”, що дозволить стабілізувати кулю практично будь-якої маси. Ствол оснащений дульною різьбою 1/2\"х28 з встановленим полум`ягасником типу А-2 та низькопрофільним нерегульованим газблоком (Carbine-Length). За необхідності його можна замінити на інший дульний пристрій. DPMS DR-15 укомплектовано УСМ типу MIL-SPEC.",
      "weight": "3,4 кг",
      "caliber": ".223 Rem",
      "barrel twist": "1:7\"",
      "weapon platform": "AR-15",
      "color": "black",
      "country_of_manufacture": "USA",
      "price": "756 460.0",
      "rating": 10,
      "stock_status": true
    },
    {
      "id": "5",
      "name": "Сокира \"Сварог\"",
      "category": "knives",
      "subcategory": "axe",
      "description": "На відмінну від ножа в багатьох ситуаціях більш корисним може виявитися тактична сокира. Багато років сокира відома як універсальний інструмент для виживання. За всю історію вона добре себе показувала навіть у боях, а в якості знаряддя праці їй немає заміни і до цього дня. \"Сварог\" є відмінним поєднанням якостей бойової сокири та господарсько-побутового інструменту. Завдяки продуманій геометрії \"Сварог\" дає можливість наносити ефективні рублячі та колючі удари, а отвори дозволяють максимально зменшити його вагу, зберігаючи міцність та надійність. Модель має цілий ряд важливих переваг: - сталь марки 65Г вирізняється високою пружністю, зносостійкістю та оптимальною твердістю для виконання цілого спектру завдань;- метал захищений полімерним покриттям, завдяки чому сокира менше піддається корозії і не блищить на сонці; - модель створена у 2014 році і без жодних кардинальних змін виготовляється до сьогодні, що свідчить про ідеальні, вивірені розміри та характеристики і продуману геометрію та ергономіку, завдяки яким він відмінно виконує поставлені перед ним завдання;- конструкція фултанг забезпечує максимальну надійність та міцність сокири у поєднанні з малою вагою та балансом; - руків’я з отворами для додаткового зменшення ваги та надійного кріплення і різноманітних способів намотки паракордового шнуру;",
      "weight": "550 г",
      "blade width": "415 mm",
      "length": "200 mm",
      "blade thickness": "8 mm",
      "material": "steel",
      "country_of_manufacture": "Ukraine",
      "price": "22 750.0",
      "rating": 10,
      "stock_status": true
    }
  ]
}
