{
  "company_name": "The Gun Store",
  "contact_info": {
    "address": "via Barberini, 31 - 00187 Roma, Italy",
    "email": "sales@thegunstore.eu",
    "phone": "+39 06 1234567"
  },
  "categories": [
    {
      "id": 1,
      "category": "Вогнепальна зброя",
      "link": "firearm",
      "subcategories": [
        "Рушниці",
        "Гвинтівки та карабіни",
        "Комбінована зброя",
        "Основні частини"
      ]
    },
    {
      "id": 2,
      "category": "Пістолети та револьвери",
      "link": "handguns",
      "subcategories": [
        "Спортивна зброя",
        "Кобури",
        "Травматичні пістолети",
        "Травматичні револьвери",
        "Комісійна травматична зброя"
      ]
    },
    {
      "id": 3,
      "category": "Пневматична зброя",
      "link": "pneumatic",
      "subcategories": [
        "Пневматичні гвинтівки",
        "Пневматичні пістолети",
        "Страйкбольна зброя",
        "Пневматичні набої та балони",
        "Комплектуючі до пневматичної зброї"
      ]
    },
    {
      "id": 4,
      "category": "Ножі",
      "link": "knives",
      "subcategories": [
        "Міські ножі",
        "Тактичні ножі",
        "Армійські ножі",
        "Сокири"
      ]
    },
    {
      "id": 5,
      "category": "Екіпірування",
      "link": "ammunition",
      "subcategories": [
        "Тюнінг",
        "Аксесуари",
        "Інструменти",
        "Приціли"
      ]
    }
  ],
  "products": [
    {
      "id": "1",
      "name": "Boker Magnum Oblong Hole",
      "manufacturer": "Boker",
      "category": 4,
      "description": "Ніж з фіксованим клинком Boker Magnum Oblong Hole призначений для повсякденного носіння і використання під час відпочинку на природі. Клинок виготовлений зі сталі 440А, на обуху є упор для великого пальця з великими насічками. Накладки рукояті виконані з полімерного матеріалу з приємним на дотик прогумованим покриттям (типу Softouch). Відчини в рукояті покликані полегшити вагу ножа. У комплект входять піхви з кордури.Упакований у фірмову коробку з логотипом компанії.",
      "weight": "96 g",
      "steel grade": "440A",
      "knife type": "non-folding",
      "blade length": "121 mm",
      "Country of manufacture": "USA",
      "price": "1 060",
      "stock_status": true
    },
    {
      "id": "2",
      "name": "Ніж із фіксованим клинком Buck Kalinga 2021 Legacy Collection",
      "manufacturer": "Buck Kalinga",
      "category": 4,
      "description": " Перед нами класичний мисливський ніж із яскраво вираженим черевцем ріжучої кромки та \"задертим\" вгору вістрям. Така конфігурація дозволяє знімати шкуру зі здобутого трофею без остраху пошкодити її. Клинок лімітованої серії виконаний із порошкової нержавіючої сталі марки CPM S35VN. Сталь відмінно тримає робочу гостроту, не схильна до появи іржі і навіть пітингу, легко точиться і правиться в польових умовах, що дуже важливо для мисливського ножа. Руків'я моделі має ергономічну форму і виконане з мікарти. Доповнює картину масивний обмежувач, що захищає вашу руку від зісковзування на ріжучу кромку. Модель комплектується піхвами з натуральної шкіри.",
      "weight": "330 g",
      "steel grade": "S35VN",
      "knife type": "non-folding",
      "blade length": "254 mm",
      "Country of manufacture": "USA",
      "price": "18 480",
      "stock_status": true
    },
    {
      "id": "3",
      "name": "Карабін FLARM F4 223Rem",
      "category": 1,
      "manufacturer": "Flarm",
      "description": "Карабін FLARM F4 калібру 223Rem з 11.5-дюймовим стволом являє собою комбінацію легкості, широких можливостей індивідуальної настройки, універсальності і сучасного дизайну, що робить його оптимальним вибором для широкого спектру завдань. Його легка вага (менше 3 кг) не тільки забезпечує комфорт при носінні, але і дозволяє стрілку залишатися маневреним в різних ситуаціях. А завдяки 1-ступінчастому спортивному ударно-спусковому механізму Timney Triggers, який характеризується коротким і м'яким ходом, стрілок отримує максимальну керованість. Інноваційна система з коротким ходом газового поршня забезпечує більш ефективне в порівнянні зі стандартним компонуванням AR-15 запобігання попадання продуктів згоряння пороху всередину зброї. Це не тільки підвищує безпеку, але й покращує довговічність. Плюс така система сприяє мінімізації нагріву і засміченню затворної групи. Це важлива перевага, яка призводить до підвищеної надійності роботи.",
      "weight": "2,89 кг",
      "caliber": ".223 Rem",
      "barrel twist": "1:8\"",
      "weapon platform": "AR-15",
      "color": "black",
      "Country of manufacture": "Ukraine",
      "price": "116 932.0",
      "stock_status": true
    },
    {
      "id": "4",
      "name": "Карабін DPMS DR-15 16” кал .223 Rem",
      "category": 1,
      "manufacturer": "DPMS",
      "description": "DR-15 - це сучасний напівавтоматичний карабін на платформі AR-15 від американського виробника DPMS. Наразі це одна з найбюджетніших пропозицій карабіну AR-15 на ринку України. Характерною особливістю моделі є незначна маса (до 3 кг) та гарна збалансованість. Карабін оснащений стволом, виготовленим із хром-молібден-ванадієвої сталі марки 4150V з фосфатованим покриттям, яке забезпечує додатковий захист від корозії. Довжина ствола 16” а крок нарізів (твіст) 1:7”, що дозволить стабілізувати кулю практично будь-якої маси. Ствол оснащений дульною різьбою 1/2\"х28 з встановленим полум`ягасником типу А-2 та низькопрофільним нерегульованим газблоком (Carbine-Length). За необхідності його можна замінити на інший дульний пристрій. DPMS DR-15 укомплектовано УСМ типу MIL-SPEC.",
      "weight": "3,4 кг",
      "caliber": ".223 Rem",
      "barrel twist": "1:7\"",
      "weapon platform": "AR-15",
      "color": "black",
      "Country of manufacture": "USA",
      "price": "756 460.0",
      "stock_status": true
    }
  ]
}
