import Container from '@/components/Container/Container';
import s from './AboutUs.module.scss';

function AboutUs() {
  return (
    <Container className={s.container}>
      <p>
        <span>Athena.com.ua</span> – лідер на ринку зброї в інтернеті.
      </p>
      <p>
        Ми займаємося продажем пневматичної зброї з 2005 року, а наш
        інтернет-магазин працює з березня 2006 року. За цей час наш асортимент
        значно розширився і зараз є одним з найширших не тільки серед
        інтернет-магазинів. У нас представлений величезний вибір гвинтівок,
        пістолетів, прицілів, куль та інших аксесуарів, який ви не знайдете в
        жодному іншому магазині в Україні!
      </p>

      <p>
        Наші клієнти високо цінують надійність нашої компанії та високий рівень
        сервісу, багато з них стають постійними. З відгуками про нашу роботу ви
        можете ознайомитися на нашому форумі або просто ввівши запит в
        інтернеті.
      </p>

      <p>
        Ми спеціалізуємося на пневматичній зброї та аксесуарах до неї. Вся
        продукція, представлена в нашому магазині, не потребує дозволів та
        реєстрації у органах внутрішніх справ України.
      </p>

      <p>Бажаємо вам вдалих покупок!</p>
    </Container>
  );
}

export default AboutUs;
