export const CONSTANTS = {
  STATIC_FOLDER: import.meta.env.VITE_STATIC_FOLDER,
  COMPANY_NAME: 'The Gun Store',
  ADDRESS: 'via Barberini, 31 - 00187 Roma, Italy',
  EMAIL: 'sales@thegunstore.eu',
  PHONE: '+39 06 1234567',
  QUESTIONS: [
    {
      question: 'Як купити зброю',
      answer:
        'В Україні існує поділ на бойову (стрілецьку) і цивільну зброю. Звичайно, бойові або військові екземпляри, які перебувають на озброєнні, неможливо придбати ні за яких обставин. Порядок придбання, зберігання і носіння цивільної зброї викладено в Інструкції, затвердженій Наказом МВС України № 622 від 21.0898 року',
    },
    {
      question: 'Що таке холодна зброя',
      answer:
        'Холодна зброя - предмети та пристрої, конструктивно призначені та за своїми властивостями придатні для неодноразового заподіяння шляхом безпосередньої дії тяжких (небезпечних для життя в момент спричинення) і смертельних тілесних ушкоджень, дія яких ґрунтується на використанні м’язової сили людини.',
    },
    {
      question: 'З якого віку я можу придбати холодну зброю',
      answer:
        'Холодну зброю мають право придбавати громадяни України або особи, які мають посвідку на постійне проживання і досягли 18-річного віку.',
    },
    {
      question:
        'З якого віку я можу придбати пневматичну зброю та зброю під патрон Флобера',
      answer:
        'Пневматичну зброю і зброю під патрон Флобера мають право придбавати громадяни України або особи, які мають посвідку на постійне проживання і досягли 18-річного віку.',
    },
    {
      question: 'Чи є лук (арбалет) зброєю',
      answer:
        'Арбалети або луки з силою натягу до 20 кг не є холодною метальною зброєю. Луки та арбалети з силою натягу понад 20 кг відносяться до холодної метальної зброї - для їх придбання потрібен спеціальний дозвіл на придбання холодної зброї, виданий органом (підрозділом) поліції.',
    },
  ],
};
